import React from 'react';

// Example workshops data
const workshops = [
  {
    title: 'Програм Малци Зналци',
    date: 'Програм почиње са радом 01.11.2024 године и траје до 30.06.2025 године. Време одржавања наставе је понедељак среда и петак. Беби зналци од 17.00 до 17.45. Јуниор зналци од 18.00 до 18.45. Сениори зналци од 19.00 до 20.00 часова.',
    instructor: 'Име инструктора',
    description: 'Програм Малци Зналци је програм кој се базира на побољшање моторичких способности деце узраста од 4 до 6 година кроз вежбе и игру, подстицање креативног развоја код деце (цртање и израда предмета) упознавање деце са наукама као што су хемија, физика, математика, билологија, историја и географија кроз игру и начине које су прилагођене узрасту полазника. У зависности од узраста часови трају од 45 до 60 минута (4 ГОДИНА ЧАС 45 МИНУТА, 5 ГОДИНА ЧАС 45 МИНУТА И 6 ГОДИНА ЧАС 60 МИНУТА). Програм се реализује у континуитету и то три пута недељно у групама од по 10 полазника.',
  },
  {
    title: 'Програм допуне знања Школарци - Зналци за основну школу',
    date: 'Програм школарци-зналци почиње са радом од 01.11.2024 и траје до 30.05.2025 године. Настава се одвија уторком и четвртком.',
    instructor: 'Име инструктора',
    description: 'Програм допуне знања Школарци -Зналци за Основну школу је програм намењен ученицима школског узраста и то од првог до четвртог разреда. Програм је осмишљен да полазницима пружи подршку у усвајању функционалног знања уз помоћ учитеља и педагога са посебним освртом на технике учења. Програм се реализује два пута недељно у трајењу од 60 минута у групама до 5 полазника.',
  },
  {
    title: 'Програм допуне знања и лакше савладавање задатака',
    date: 'Програм почиње са радом од 01.11.2024 и траје до 30.05.2025 године.',
    instructor: 'Име инструктора',
    description: 'Програм допуне знања и лакше савладавање задатака је намењен ученицима од петог до седмог разреда.У овом програму настава се реализује једанпута недељно по предмету у трајењу од 60 минута, односно три пута недељно за групу од три предмета . Програм нуди индивидуалне часовекао и групну наставу. Овај програм нуди и могућност професијоналне оријентације, као и могућност технике учења ради стицања функционалног знања. Модул часова: индивидуални и група до пет полазника. Приступ индивидуализовани.',
  },
  {
    title: 'Завршни испит',
    date: 'Циклус припреме почиње са тестирањима 30.11 и 01.12.2024 а настава почиње 07.12.2024 и траје све до 15.06.2025 године.',
    instructor: 'Име инструктора',
    description: 'Програм завршног испита је програм прилагођен припремној настави за завршни испит, настава се одвија по групама, и то група до пет полазника или група до дванаест полазника, полазници програма минимум пута месечно врше проверу знања, а законски заступници родитељи/старатељи на месечном нивоу добијају анализу постигнутих резултата. На основу индикатора креирани од стране предметног наставника,психолга и педагога врши се анализа савладаног знања,чиме се доприноси да сваки полазник добије индивидуализовани приступ и потребну подршку за постизање изузетних резултата на завршном испиту.Програм обухвата следеће предмете српски језик и књижевност,математика и изборни предмет по жељи полазника. Настава се одвија суботом и недељом у трајању од 3 сата и 30 минута ( три часа од по 60 минута са паузама од 15 минута између сваког предмета). За полазнике програма завршних разреда обезбеђени су бесплатни тестови професионалног оријентисања.',
  },
  {
    title: 'ХОРИЋ',
    date: 'Хорић понедељак и петак од 19.00 до 20.00. Популано певање се одвија суботом од 13.00 или у току недеље у договору са професором.',
    instructor: 'Име инструктора',
    description: 'Едукативни центар има и своји хорић чланови хора су деца узраста од 6 година до 12 година. Два пута недељно у трајењу од 60 минута. Популано певање 60 минута једном недељно.',
  },
  // Add more workshops as needed
];

function Workshops() {
  return (
    <div className="relative">
      {/* Overlay */}
      <div className="absolute inset-0 bg-black opacity-50"></div>

      {/* Content */}
      <div className="relative max-w-7xl mx-auto px-4 py-12 z-10 text-white">
        <h2 className="text-3xl font-bold text-center mb-8">Радионице</h2>
        <div className="space-y-6">
          {workshops.map((workshop, index) => (
            <div key={index} className="bg-white bg-opacity-25 rounded-lg shadow-md p-6">
              <h3 className="text-2xl font-semibold mb-4">{workshop.title}</h3>
              <p className="text-2 mb-2">{workshop.date}</p>
              <p className="text-2 mb-2">Инструктор: {workshop.instructor}</p>
              <p className="text-2 mb-2">{workshop.description}</p>
              <div className="mt-4">
                <button className="bg-green-800 text-white px-4 py-2 rounded-md hover:bg-green-900">Пријавите се</button>
              </div>
            </div>
          ))}
        </div>
      </div>
    </div>
  );
}

export default Workshops;
